Revit 2026 API

# DividedPathIsClosedLoop Property

---

Whether or not the path forms a closed loop.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsClosedLoop { get; }
```
```vb
Public ReadOnly Property IsClosedLoop As Boolean
	Get
```
```cpp
public:
property bool IsClosedLoop {
	bool get ();
}
```
```fsharp
member IsClosedLoop : bool with get
```

#### Property Value

Boolean

True if the path form a closed loop. False otherwise.

#### Reference

DividedPath Class

Autodesk.Revit.DB Namespace